In [84]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
data=sns.load_dataset('titanic')

In [85]:
data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [86]:
columns=["sex","embarked","pclass","alone","survived"]
data=data[columns].head()

In [87]:
data["sex"]=np.where(data["sex"]=="male",1,0)

In [88]:
data.head()

   sex embarked  pclass  alone  survived
0    1        S       3  False         0
1    0        C       1  False         1
2    0        S       3   True         1
3    0        S       1  False         1
4    1        S       3   True         0

In [89]:
data["embarked"].unique()

array(['S', 'C'], dtype=object)

In [90]:
mapping={k:i for i,k in enumerate(data["embarked"].unique(),0)}
data["embarked"]=data["embarked"].map(mapping)

In [91]:
data["alone"]=np.where(data["alone"]==True,1,0)

In [92]:
data.head()

   sex  embarked  pclass  alone  survived
0    1         0       3      0         0
1    0         1       1      0         1
2    0         0       3      1         1
3    0         0       1      0         1
4    1         0       3      1         0

In [93]:
x=data.drop("survived",axis=True)
y=data["survived"]

In [94]:
from sklearn.model_selection import train_test_split
xtrain,xtest,ytrain,ytest=train_test_split(x,y,test_size=0.3,random_state=100)

In [95]:
xtrain.isnull().sum()

sex         0
embarked    0
pclass      0
alone       0
dtype: int64

In [96]:
from sklearn.feature_selection import chi2
f_p_values=chi2(xtrain,ytrain)

In [97]:
fp_val

0                                 [2.0, 1.0, 2.0, nan]
1    [0.15729920705028105, 0.31731050786291115, 0.1...
dtype: object

In [99]:
fp_val=pd.Series(fp_val[1])
fp_val

0    0.157299
1    0.317311
2    0.157299
3         NaN
dtype: float64

In [101]:
fp_val.index=xtrain.columns

In [102]:
fp_val

sex         0.157299
embarked    0.317311
pclass      0.157299
alone            NaN
dtype: float64

In [104]:
fp_val.sort_index(ascending=False)

sex         0.157299
pclass      0.157299
embarked    0.317311
alone            NaN
dtype: float64